Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/carers/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview Document Payments to carers Find out about the different payments and benefits for carers
ga: Overview Document Na híocaíochtaí do chúramóirí Faigh amach eolas faoi na híocaíochtaí agus sochair do chúramóirí

source: Carer's Allowance is a means-tested payment to people on low incomes who are caring for an incapacitated person
ga: Is íocaíocht é a bhfuil fiosrú maoine deanta air agus tugtar é do dhaoine atá ag tabhairt cúram do dhaoine atá ag brath orthu

source: Half-rate Carer's Allowance is payable with certain other social welfare payments provided you meet the qualifying criteria
ga: Tá Liúntas Cúramóra leath-ráta iníoctha le híocaíochtaí leasa sóisialta áirithe eile

source: Find out how to qualify for half-rate Carer's Allowance
ga: Ar an choinníoll go gcomhlíonann tú na critéir cháilithe Faigh tuilleadh eolais maidir le conas bheith incháilithe do Liúntas Cúramóra leath-ráta

source: Carer's Benefit is a social insurance payment made to someone who gives up work to care for an incapacitated person
ga: Tá cur síos anseo ar shochar cúramaí, íocaíocht leasa shóisialaigh le duine a fhágann a c(h)uid oibre ar mhaithe le haire a thabhairt do dhuine faoi éagumas

source: Carer's Support Grant (formerly called Respite Care Grant)
ga: Deontas Tacaíochta do Chúramóirí (ar a dtugadh an Deontas Cúraim Faoisimh)

source: Carer's Support Grant is an annual cash payment to carers.It was called the Respite Care Grant until 2016
ga: Íocaíocht bhliaintúil do chúramóirí is ea an Deontas Tacaíochta do Chúramóirí. An Deontas Cúraim Faoisimh a bhí i gceit roimh 2016

source: A Domiciliary Care Allowance is a monthly payment made to the carer of a child with a severe disability who lives at home
ga: Íocaíocht mhíosúil é Liúntas Cúram Baile a dhéantar le cúramóir linbh a bhfuil míchumas trom air agus a bhfuil ina chónaí sa bhaile

source: This document is in: Social Welfare > Social welfare payments > Disability and illness
ga: This document is in: Leas Sóisialach > Íocaíochtaí Leasa Shóisialaigh > Míchumas agus Tinneas

source: Most Read in "Social Welfare"
ga: Ábhar is mó éilimh i "Leas Sóisialach"

source: Back to School Clothing and Footwear Allowance
ga: Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil
